app/controllers/listings_controller.rb

SELECT * FROM "listings"
---
  def index
    @listings = Listing.all

SELECT * FROM "listings" WHERE ("listings"."id" = 1)
DELETE FROM "listings" WHERE "id" = 1
---
  def destroy
    @listing = Listing.find(params[:id])
    @listing.destroy