app/controllers/listings_controller.rb

SELECT * FROM "listings" WHERE ("listings"."id" = 1)
SELECT * FROM "messages" WHERE ("messages"."listing_id" = 3 AND "messages"."to" = 7)
SELECT * FROM "offers" WHERE (user_id = 7 and listing_id = 4) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
UPDATE "listings" SET "updated_at" = '2010-12-13 10:23:49', "newOffer" = 'f' WHERE "id" = 5
UPDATE "offers" SET "updated_at" = '2010-12-13 10:35:44', "listingChanged" = 'f' WHERE "id" = 34
---
  def show
    @listing = Listing.find(params[:id])
    if @listing.active==false
	flash.now[:warning] = 'This listing is now inactive. Unless the employer choses to use another worker, it will not be activated again.'
    end
    if current_user
    user = current_user
    # Notification
    @messagesToThisListing = Message.find(:all, :conditions=>{:to => current_user.id, :listing_id => @listing.id})
    @messagesToThisListing.each do |msgt|
	msgt.unread = false
	msgt.save
    end
    # End Add
    @distance = LatLng.new(user.lat,user.lng).distance_to(LatLng.new(@listing.lat,@listing.lng))
    if current_user.id!=@listing.user.id
	@offer = Offer.new
	@past_offer = Offer.find(:first, :conditions=>['user_id = ? and listing_id = ?', current_user.id, @listing.id])
	# Notification Add
	if @past_offer != nil
		@past_offer.listingChanged = false
		@past_offer.save

SELECT * FROM "messages" WHERE ("messages"."listing_id" = 3 AND "messages"."from" IN (7,3) AND "messages"."to" IN (3,7)) ORDER BY created_at
---
		@place = {:lat=>@listing.lat, :lng=>@listing.lng}
	end
	@new_message = Message.new
	@messages = Message.find(:all, :conditions=>{:from=>[current_user.id, @listing.user.id], :to=>[@listing.user.id, current_user.id], :listing_id=>@listing.id}, :order=>"created_at")

SELECT * FROM "listings" WHERE ("listings"."id" = 1)
---
  def edit
    @listing = Listing.find(params[:id])

SELECT * FROM "listings" WHERE (listings.id IN (5,4)) AND (category='Gardening')
SELECT * FROM "listings" WHERE (listings.id IN (5)) AND ("listings"."category" IN ('Baby-Sitting','Gardening'))
SELECT * FROM "listings"
---
  def process_search
      @results = nil
      @dresults = []
      if params[:cats].nil?; params[:cats] = ['All']; end
      if params[:title]["title"]=="Search for work"; params[:title]["title"] = ""; end
      if params[:cats].include?('All')
	if params[:title]["title"].empty?; @results = Listing.find(:all, :conditions=>{:active=>true})
	else; @results = Listing.find_with_index(params[:title]["title"], {:conditions=>{:active=>true}})
        end
      else
	if params[:title]["title"].empty?; @results = Listing.find(:all, :conditions=>{:category=>params[:cats], :active=>true})
        else; @results = Listing.find_with_index(params[:title]["title"], {:conditions=>{:category=>params[:cats], :active=>true}})
        end
      end
      if current_user; @user = current_user
      else; geoc = IpGeocoder.geocode(request.remote_ip); @user = User.new(:lat=>geoc.lat, :lng=>geoc.lng)
      end
      @results.each do |result|

SELECT * FROM "listings" WHERE ("listings"."id" = 3)
UPDATE "listings" SET "updated_at" = '2010-12-08 03:00:51', "employer_rating" = 0.0 WHERE "id" = 3
UPDATE "users" SET "updated_at" = '2010-12-08 03:22:31', "num_eratings" = 1, "employer_rating" = 4.0 WHERE "id" = 3
---
  def add_erating
	params["rating"] = params["rating"] or 0
	@listing = Listing.find(params['listing_id'])
	employer = @listing.user
	if @listing.employer_rating!=nil
		employer.employer_rating = ((employer.employer_rating*employer.num_eratings)-@listing.employer_rating)/(employer.num_eratings-1)
		employer.num_eratings = (employer.num_eratings-1)
		if employer.num_eratings==0; employer.employer_rating=0; end
	end
	@listing.employer_rating = params["rating"]
	if @listing.save

SELECT * FROM "listings" WHERE ("listings"."id" = 3)
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
UPDATE "listings" SET "updated_at" = '2010-12-09 00:17:09', "worker_rating" = 4.0 WHERE "id" = 3
UPDATE "users" SET "updated_at" = '2010-12-09 00:17:09', "worker_rating" = 4.0, "num_wratings" = 1 WHERE "id" = 7
---
  def add_wrating
	params["rating"] = params["rating"] or 0
	@listing = Listing.find(params['listing_id'])
	worker = User.find(params['worker_id'])
	if @listing.worker_rating!=nil
		worker.worker_rating = ((worker.worker_rating*worker.num_wratings)-@listing.worker_rating)/(worker.num_wratings-1)
		worker.num_wratings = (worker.num_wratings-1)
		if worker.num_wratings==0; worker.worker_rating=0; end
	end
	@listing.worker_rating = params["rating"]
	if @listing.save
		worker.worker_rating = ((worker.worker_rating*worker.num_wratings)+@listing.worker_rating)/(worker.num_wratings+1)
		worker.num_wratings = (worker.num_wratings+1)
		worker.save

INSERT INTO "listings" ("address", "category", "created_at", "worker_rating", "employer_rating", "title", "updated_at", "approx_payment", "lng", "user_id", "description", "lat", "active") VALUES('2467 Warring St. Apt. 305, Berkeley, CA 94704', 'Baby-Sitting', '2010-12-07 11:07:00', NULL, NULL, 'Mold Cleanup', '2010-12-07 11:07:00', 50.0, -122.250431, 8, 'I have a bunch of mold in my apartment that needs to be cleaned up.', 37.866147, 't')
---
  def create
    @listing = Listing.new(params[:listing])
    @listing.user_id = current_user.id
    geocode = GoogleGeocoder.geocode(@listing.address)
    @listing.lat = geocode.lat
    @listing.lng = geocode.lng

    respond_to do |format|
      if @listing.save

SELECT * FROM "listings" WHERE ("listings"."id" = 3)
SELECT * FROM "offers" WHERE ("offers"."listing_id" = 3)
UPDATE "listings" SET "updated_at" = '2010-12-06 20:16:21', "active" = 'f' WHERE "id" = 3
UPDATE "offers" SET "updated_at" = '2010-12-13 10:36:45', "listingChanged" = 't' WHERE "id" = 34
---
  def acceptOffer
	@listing = Listing.find(params[:listing_id])
	# Notification flag
	@offers = Offer.find(:all, :conditions=>{:listing_id => @listing.id})
	@offers.each do |offer|
		offer.listingChanged = true
		offer.save

SELECT * FROM "listings" WHERE ("listings"."id" = 3)
SELECT * FROM "offers" WHERE ("offers"."listing_id" = 3)
UPDATE "listings" SET "updated_at" = '2010-12-06 22:06:00', "active" = 't' WHERE "id" = 3
UPDATE "offers" SET "updated_at" = '2010-12-13 10:35:16', "listingChanged" = 't' WHERE "id" = 34
---
  def rescindOffer
	@listing = Listing.find(params[:listing_id])
	@offer = Offer.find(params[:offer_id])
	@offer.accepted = false
	# Notification flag
	@offers = Offer.find(:all, :conditions=>{:listing_id => @listing.id})
	@offers.each do |offer|
		offer.listingChanged = true
		offer.save

SELECT * FROM "listings" WHERE ("listings"."id" = 4)
UPDATE "listings" SET "updated_at" = '2010-12-07 12:16:25', "lng" = -122.250431, "lat" = 37.866147, "address" = '2467 Warring St. Apt. 305 Berkeley CA 94704' WHERE "id" = 3
---
  def update
    @listing = Listing.find(params[:id])

	geocode = GoogleGeocoder.geocode(params[:listing][:address])
	@listing.lat = geocode.lat
	@listing.lng = geocode.lng

    respond_to do |format|
      if @listing.update_attributes(params[:listing])