app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT * FROM "messages"

  def show
    @message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 1)

  def edit
    @message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 3)

  def create
    @message = Message.new(params[:message])

    if @message.save
---
INSERT INTO "messages" ("created_at", "from", "updated_at", "listing_id", "unread", "to", "content") VALUES('2010-12-13 10:24:08', 6, '2010-12-13 10:24:08', 5, 't', 7, 'I want a slow death please')

  def update
    @message = Message.find(params[:id])

    respond_to do |format|
      if @message.update_attributes(params[:message])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 3)
UPDATE "messages" SET "updated_at" = '2010-12-05 08:09:12', "content" = 'the resply is awesome', "from" = 6, "to" = 3 WHERE "id" = 3

  def destroy
    @message = Message.find(params[:id])
    @message.destroy
---
SELECT * FROM "messages" WHERE ("messages"."id" = 1)
DELETE FROM "messages" WHERE "id" = 1