app/controllers/offers_controller.rb

  def index
    @offers = Offer.all
---
SELECT * FROM "offers"

  def show
    @offer = Offer.find(params[:id])
---
SELECT * FROM "offers" WHERE ("offers"."id" = 1)

  def create
    @offer = Offer.new(params[:offer])

    if @offer.save
       	# Notification flag
	@listing = @offer.listing
	@listing.newOffer = true
	if @listing.save
---
INSERT INTO "offers" ("created_at", "updated_at", "listing_id", "amount", "user_id", "listingChanged", "accepted", "distance") VALUES('2010-12-13 10:22:43', '2010-12-13 10:22:43', 5, 1.0, 7, 'f', 'f', NULL)
UPDATE "listings" SET "updated_at" = '2010-12-13 10:22:43', "newOffer" = 't' WHERE "id" = 5

  def update
    @offer = Offer.find(params[:id])

    if @offer.update_attributes(params[:offer])
---
SELECT * FROM "offers" WHERE ("offers"."id" = 33)
UPDATE "offers" SET "updated_at" = '2010-11-23 03:57:32', "amount" = 23.0 WHERE "id" = 33

  def destroy
    @offer = Offer.find(params[:id])
    @offer.destroy
---
SELECT * FROM "offers" WHERE ("offers"."id" = 1)
DELETE FROM "offers" WHERE "id" = 1