app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "address", "created_at", "employer_rating", "num_eratings", "worker_rating", "crypted_password", "remember_token_expires_at", "num_wratings", "updated_at", "lng", "remember_token", "description", "login", "lat", "email") VALUES('9f89ed5c11abbebd590f29adda308f85e88e7804', NULL, '2010-12-12 22:54:42', 0.0, 0, 0.0, '5c228f78004cd740e76dbad21c3c3601c74066bb', NULL, 0, '2010-12-12 22:54:42', -79.9507621, NULL, 'I am Amadou', 'amadou', 40.4469593, 'ama@ama.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    geocode = GoogleGeocoder.geocode(@user.address)
    @user.lat = geocode.lat
    @user.lng = geocode.lng

    success = @user && @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def show #profile
	@user = User.find(params[:id])

DELETE FROM "users" WHERE "id" = 1
---
  def destroy
    @user = current_user
    logout_killing_session!
    @user.destroy

UPDATE "users" SET "updated_at" = '2010-12-11 00:58:17', "lng" = -122.268225, "lat" = 37.876501, "address" = '2112 Virginia St, Berkeley, CA' WHERE "id" = 3
---
  def update
    @user = current_user
    geocode = GoogleGeocoder.geocode(params[:user][:address])
    @user.lat = geocode.lat
    @user.lng = geocode.lng
    @user.address = params[:user][:address]

    respond_to do |format|
      if @user.update_attributes(params[:user])