app/controllers/welcome_controller.rb

	def index

		if current_user


			@activeReds = Array.new
			@activeGreys = Array.new

			# @inactiveGreens = Array.new
			# @inactiveReds = Array.new
			# @inactiveGreys = Array.new


			#ACTIVE LISTINGS
			@biglist = Array.new
			@listings = Listing.find(:all, :conditions=>{:user_id => current_user.id, :active => true})
			@offers = Offer.find(:all, :conditions=>{:user_id => current_user.id,})
---
SELECT * FROM "listings" WHERE ("listings"."user_id" = 7 AND "listings"."active" = 't')
SELECT * FROM "offers" WHERE ("offers"."user_id" = 7)


						toAdd.msgnum = 0
						toAdd.color = 'green'
						toAdd.msg = '' + listing.offers.size.to_s + ' user(s) have offered to work for you.'
						@biglist.push toAdd
					 else
						@msgs = Message.find(:all, :conditions=>{:to => current_user.id, :listing_id => listing.id, :unread => true})
---
SELECT count(*) AS count_all FROM "offers" WHERE ("offers".listing_id = 4)
SELECT * FROM "messages" WHERE ("messages"."listing_id" = 3 AND "messages"."unread" = 't' AND "messages"."to" = 7)